{
  "users": [
    {
      "id": 1,
      "name": "Madison",
      "email": "Madison@me.com",
      "password": "porsche911"
    },
    {
      "id": 2,
      "name": "Brian",
      "email": "Brian@me.com",
      "password": "nissan370z"
    },
    {
      "id": 3,
      "name": "Ryan",
      "email": "Ryane@me.com",
      "password": "bmw335i"
    },
    {
      "id": 4,
      "name": "Lynn",
      "email": "Lynn@me.com",
      "password": "abcd"
    },
    {
      "id": 5,
      "name": "Collin",
      "email": "Collin@me.com",
      "password": "supra"
    }
  ],
  "articles": [
    {
      "id": 1,
      "url": "https://www.carthrottle.com/post/cargo-ship-carrying-porsches-lamborghinis-and-more-sinks-following-fire/",
      "img": "https://images.cdn.circlesix.co/image/1/1366/0/uploads/posts/2022/03/c6761eda23e85283a5869cb979676dc8.jpeg",
      "title": "Cargo Ship Carrying Porsches, Lamborghinis And More Sinks Following Fire",
      "synopsis": "The stricken Felicity Ace sank in rough seas on Tuesday, taking around 4000 cars to the bottom of the Atlantic",
      "date": "2022-03-02"
    },
    {
      "id": 2,
      "url": "https://www.motor1.com/news/571290/porsche-donate-million-ukraine-relief/",
      "img": "https://hips.hearstapps.com/hmg-prod/amv-prod-cad-assets/wp-content/uploads/2017/06/2018-Porsche-911-GT2-RS-102.jpg?crop=1.00xw:0.921xh;0,0.0341xh&resize=1200:*",
      "title": "Porsche Is Latest Automaker To Donate €1 Million For Ukraine Relief",
      "synopsis": "Porsche joins several automotive companies in donating funds for Ukrainian relief, pledging one million euros to the cause. That translates to approximately $1.1 million in US currency.",
      "date": "2022-03-03"
    }
  ],
  "carTypes": [
    {
      "id": 1,
      "name": "Porsche"
    },
    {
      "id": 2,
      "name": "Nissan"
    },
    {
      "id": 3,
      "name": "BMW"
    },
    {
      "id": 4,
      "name": "Audi"
    },
    {
      "id": 5,
      "name": "Mercedes"
    },
    {
      "id": 6,
      "name": "Toyota"
    },
    {
      "id": 7,
      "name": "Honda"
    },
    {
      "id": 8,
      "name": "Ford"
    }
  ],
  "forumPosts": [
    {
      "id": 1,
      "userId": 1,
      "title": "Cayenne engine making whining noise",
      "carTypeId": 1,
      "model": "2006 Cayenne",
      "content": "Hey everyone, my 2006 Cayenne is making a whining noise from the engine, any ideas on what it would be?",
      "date": "2022-03-02",
      "commentId": 1
    },
    {
      "id": 2,
      "userId": 3,
      "title": "Should I buy reps or are the others worth it?",
      "carTypeId": 2,
      "model": "370z",
      "content": "In my opinion, reps still look clean and obviously they're not as expensive. Are the others worth it though? Not sure about dropping 5k on rims...",
      "date": "2022-03-07",
      "commentId": 1
    },
    {
      "id": 3,
      "userId": 4,
      "title": "Taycan production delays?",
      "carTypeId": 1,
      "model": "Taycan",
      "content": "Due to the ongoing crisis in Ukraine, I heard that Porsche announced they are halting production temporarily. At first it was just the Macan and Cayenne, now appears to be the whole model range. My Taycan is currently in production as of the Track Your Dream app on 3/1. Apparently the cut off date is 3/3 so I'm hoping my car is still going to be on-time. Anyone have any information on this?",
      "date": "2022-03-08",
      "commentId": 1
    },
    {
      "id": 4,
      "userId": 2,
      "title": "335i issues?",
      "carTypeId": 3,
      "model": "335i",
      "content": "What are some common issues with the 335is? Are they reliable? And which years have which engine?",
      "date": "2022-03-11",
      "commentId": 1
    },
    {
      "id": 5,
      "userId": 4,
      "title": "2011 r8 v10 exhaust question",
      "carTypeId": 4,
      "model": "2011 r8",
      "content": "Picked up a single owner, low miles R8 v10 which I’m in love with. Can’t believe how smooth the drive is compared to my old Gallardo - albeit I must admit I prefer the Gallardo feeling but as I get older I welcome the refined drive. That said, when I start the car it’s obvious the exhaust valves are open and then after about a min or two they close, the question is shouldn’t the valves go open when I press the Sport button? I can see that if I press the sport button and drive it on Auto that it shifts at higher rpms but the exhaust note is the same whether or sport or not. From what I’ve read this is normal behavior, correct? With alternative being putting in an aftermarket exhaust?Also, I don’t notice any stiffness when putting the suspension on sport - yes, pressing both notes it on the display. Am I missing something? Thanks in advance.",
      "date": "2022-03-13",
      "commentId": 1
    },
    {
      "id": 6,
      "userId": 3,
      "title": "New to 350z Need Advice Before I Buy",
      "carTypeId": 2,
      "model": "350z",
      "content": " was looking for an 86' 300zx but the choices were just too few and awful and everybody seems to think they have a high dollar car no matter the condition. Even this old lady in my neighborhood. So! My father and I are shopping a 350z mid 2000's as a 2nd fun car and for when he visits. It has to be a manual and most likely will be a convertible but I'm not opposed to a hardtop if it's a good one. I can see a fair amount of 2006-7 with somewhat low miles 40-80k selling these day around 12-15k. KBB is around 12-13. Any general advice? Things technical to look for (I am very technical used to be a mechanic and I work on other my other cars still) Best years? Worst years? Tips tricks? I appreciate any and all advice. I have yet to even test drive one. Doing that today.",
      "date": "2022-03-11",
      "commentId": 1
    },
    {
      "id": 7,
      "userId": 1,
      "title": "Switch to synthetic oil causing rear seal leak?",
      "carTypeId": 5,
      "model": "99 E320",
      "content": "I know there's a thread on here where an expert posts a PDF with exhaustive research and knowledge on motor oil and it's effects on a variety of cars and conditions. If someone knows what I'm talking about could they post that here or link it? In the meantime, I've switched my 99 E320 wagon over to synthetic oil and suddenly I have what appears to be a rear seal leak. I actually can't find the source but it drips down where the engine meets the transmission below the little cover under the bell housing or surface plate. Any thoughts on what might cause that that's less trouble than a seal? There are a couple of hoses that are the transmission cooling lines and I just took apart the valve body and cleaned it and put in new springs and valves and a new conductor plate and flushed the ATF. This is definitely not ATF, it's motor oil. Although this dripping started after doing the transmission. My only thought there was that when I got it back together it ran like a new car! It seemed like the power was way up the shifting was perfect and I took it out and ran it up to 4,000 RPMs just to make sure that the limp mode conductor plate speed sensor problem was solved. Could revving it higher than it normally goes cause that leak? It does have 220,000 miles on it.",
      "date": "2022-03-07",
      "commentId": 1
    },
    {
      "id": 8,
      "userId": 1,
      "title": "Thoughts/Feedback on VividRacing and Titan catback exhausts?",
      "carTypeId": 6,
      "model": "MK5 Supra",
      "content": "Hey guys, I've been keeping my eye out for for a dual exit valved titanium catback setup that still uses the valves. I also don't want to break the bank, so l'm ruling Boostlogic, Akrapovic, and other kits that cost as much as a BBK. Any thoughts and feedback on either the VividRacing or Titan catback exhausts? Fitment, drone, ease of installation, how much of an impact do the valves make?",
      "date": "3/12/2022, 9:08:28 AM",
      "commentId": 1
    },
    {
      "id": 9,
      "userId": 1,
      "title": "Fuel Efficiency Mods MPG",
      "carTypeId": 7,
      "model": "Honda Civic",
      "content": "We all want to squeeze as much power out of our Civics but some of us are focused on fuel efficiency as well. Especially w gas at $4+! Has anyone had any luck w mods and tweeks to up their MPG? I'm planning on installing a new air intake kit that will improve HP, and I'm guessing it will increase MPG too if I drive the car with economy in mind vs performance. I have a 1.5 turbo. Any thoughts and ideas? Thanks. Will share my results as I learn more.",
      "date": "3/12/2022, 9:10:28 AM",
      "commentId": 1
    },
    {
      "id": 10,
      "userId": 1,
      "title": "2014 GT Main Computer System Crash",
      "carTypeId": 8,
      "model": "2014 mustang GT",
      "content": "what would cause a main computer system to short out in these cars? It's a rebuilt title from a rear end collision, if that helps.",
      "date": "3/12/2022, 9:10:53 AM",
      "commentId": 1
    },
    {
      "id": 11,
      "userId": 1,
      "title": "Lift Assist 2020 911 992",
      "carTypeId": 1,
      "model": "911 992",
      "content": "I have a 2020 911 992 and it is equipped with Lift assist. The only way I can operate this feature is manually. is there a way for me to store/save the locations I use the lift assist in my vehicle?  I have seen that Porsche Tycoon has a place in the CAR setting to save locations. I can't find this on my 992!!",
      "date": "3/14/2022, 3:44:53 AM",
      "commentId": 1
    },
    {
      "id": 12,
      "userId": 1,
      "title": "My Supra Might Be a BMW",
      "carTypeId": 6,
      "model": "mkv supra",
      "content": "engine says bmw in my mkv surpra",
      "date": "3/14/2022, 10:34:11 PM",
      "commentId": 0
    }
  ],
  "postComments": [
    {
      "id": 1,
      "userId": 2,
      "content": "Is it the belt? Have you checked the oil?",
      "postId": 1,
      "date": "2022-03-04"
    },
    {
      "id": 2,
      "userId": 4,
      "content": "any exposed wires? that's the only way i think and main computer system could completely short out.",
      "postId": 10,
      "date": "3/12/2022, 9:10:53 AM"
    },
    {
      "id": 3,
      "userId": 5,
      "content": "That feature is optional - front axle lift system adds GPS capability so that it can remember to automatically lift the nose at certain programmable locations. See if that was included in the package of your car. Otherwise, may be out of luck in getting it to do it automatically.",
      "postId": 11,
      "date": "3/14/2022, 3:47:53 AM"
    },
    {
      "id": 4,
      "userId": 2,
      "content": "I'm told the GPS assisted is on the 21 builds (to be confrimed). I cant find any info also.",
      "postId": 11,
      "date": "3/14/2022, 3:47:53 AM"
    },
    {
      "userId": 1,
      "content": "testing comment",
      "postId": 1,
      "date": "3/14/2022, 10:27:58 PM",
      "id": 5
    },
    {
      "userId": 5,
      "content": "that's defo a bmw",
      "postId": 12,
      "date": "3/14/2022, 10:35:20 PM",
      "id": 6
    }
  ]
}